OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBD_RNDIS/rndis.c
/***************************************************************************//**
 * @file     rndis.c
 * @version  V3.00
 * @brief    HSUSBD RNDIS sample file.
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2024 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
#include <string.h>
#include "NuMicro.h"
#include "rndis.h"

#include "m55m1_emac.h"
#include "m55m1_mii.h"

#if (NVT_DCACHE_ON == 1)
/* Declare the dedicated RNDIS_MSG_Q buffer as non-cacheable. */
/* Note: Ensure that NVT_DCACHE_ON is enabled and the ARM MPU is initialized for the non-cacheable region in your project. */
NVT_NONCACHEABLE volatile RNDIS_MSG_Q _rtxq __attribute__((aligned(32))) = { 0 };
NVT_NONCACHEABLE volatile RNDIS_MSG_Q _rrxq __attribute__((aligned(32))) = { 0 };
#else
volatile RNDIS_MSG_Q _rtxq __attribute__((aligned(32))) = { 0 };
volatile RNDIS_MSG_Q _rrxq __attribute__((aligned(32))) = { 0 };
#endif

#ifdef __ICCARM__
    #pragma data_alignment=4
    uint8_t rndis_command[256];
    uint8_t rndis_response[256];
#else
    NVT_DTCM uint8_t rndis_command[256] __attribute__((aligned(32)));
    NVT_DTCM uint8_t rndis_response[256] __attribute__((aligned(32)));
#endif

uint32_t rndis_oidbuffer[] __attribute__((aligned(4))) =
{
    OID_GEN_SUPPORTED_LIST,         //0x00010101
    OID_GEN_HARDWARE_STATUS,        //0x00010102
    OID_GEN_MEDIA_SUPPORTED,        //0x00010103
    OID_GEN_MEDIA_IN_USE,           //0x00010104
    OID_GEN_MAXIMUM_FRAME_SIZE,     //0x00010106
    OID_GEN_LINK_SPEED,             //0x00010107
    OID_GEN_TRANSMIT_BLOCK_SIZE,    //0x0001010A
    OID_GEN_RECEIVE_BLOCK_SIZE,     //0x0001010B
    OID_GEN_VENDOR_ID,              //0x0001010C
    OID_GEN_VENDOR_DESCRIPTION,     //0x0001010D
    OID_GEN_VENDOR_DRIVER_VERSION,  //0x00010116
    OID_GEN_CURRENT_PACKET_FILTER,  //0x0001010E
    OID_GEN_MAXIMUM_TOTAL_SIZE,     //0x00010111
    OID_GEN_MEDIA_CONNECT_STATUS,   //0x00010114
    OID_GEN_PHYSICAL_MEDIUM,        //0x00010202
    OID_GEN_XMIT_OK,                //0x00020101
    OID_GEN_RCV_OK,                 //0x00020102
    OID_GEN_XMIT_ERROR,             //0x00020103
    OID_GEN_RCV_ERROR,              //0x00020104
    OID_GEN_RCV_NO_BUFFER,          //0x00020105
    OID_802_3_PERMANENT_ADDRESS,    //0x01010101
    OID_802_3_CURRENT_ADDRESS,      //0x01010102
    OID_802_3_MULTICAST_LIST,       //0x01010103
    OID_802_3_MAC_OPTIONS,          //0x01010105
    OID_802_3_MAXIMUM_LIST_SIZE,    //0x01010104
    OID_802_3_RCV_ERROR_ALIGNMENT,  //0x01020101
    OID_802_3_XMIT_ONE_COLLISION,   //0x01020102
    OID_802_3_XMIT_MORE_COLLISIONS  //0x01020103
};

volatile uint8_t gRndisInData = 0;

extern uint8_t g_au8MacAddr[6];

extern uint32_t u32TxCnt, u32RxCnt;
volatile uint32_t linkStatus;

/*--------------------------------------------------------------------------*/
/* MS OS Feature descriptor */
const unsigned char OS_feature_dsc[] =
{
    0x28, 0x00, 0x00, 0x00, /* dwLength */
    0x00, 0x01, /* bcdVersion */
    0x04, 0x00, /* wIndex */
    0x01,       /* bCount */
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, /* reserve 7 bytes */
    0x00,       /* bInterfaceNumber */
    0x01,       /* reserved */
    /* The following is compatible ID 8 bytes (RNDIS) */
    0x52, 0x4E, 0x44, 0x49, 0x53, 0x00, 0x00, 0x00,
    /* The following is SubCompatible ID null 8 bytes (5162001) */
    0x35, 0x31, 0x36, 0x32, 0x30, 0x30, 0x31, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, /* reserve 6 bytes */
};
void RNDIS_OutData_DMA(uint32_t u32Addr, unsigned int u32PktLen);
/*--------------------------------------------------------------------------*/
void HSUSBD_IRQHandler(void)
{
    __IO uint32_t IrqStL, IrqSt;
    uint32_t u32TimeOutCnt;

    IrqStL = HSUSBD->GINTSTS & HSUSBD->GINTEN;    /* get interrupt status */

    if (!IrqStL)    return;

    /* USB interrupt */
    if (IrqStL & HSUSBD_GINTSTS_USBIF_Msk)
    {
        IrqSt = HSUSBD->BUSINTSTS & HSUSBD->BUSINTEN;

        if (IrqSt & HSUSBD_BUSINTSTS_SOFIF_Msk)
            HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_SOFIF_Msk);

        if (IrqSt & HSUSBD_BUSINTSTS_RSTIF_Msk)
        {
            HSUSBD_SwReset();

            HSUSBD_ResetDMA();
            HSUSBD->EP[EPA].EPRSPCTL = HSUSBD_EPRSPCTL_FLUSH_Msk;
            HSUSBD->EP[EPB].EPRSPCTL = HSUSBD_EPRSPCTL_FLUSH_Msk;

            if (HSUSBD->OPER & 0x04)  /* high speed */
                RNDIS_InitForHighSpeed();
            else                    /* full speed */
                RNDIS_InitForFullSpeed();

            HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPPKIEN_Msk);
            HSUSBD_SET_ADDR(0);
            HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_RESUMEIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk);
            HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_RSTIF_Msk);
            HSUSBD_CLR_CEP_INT_FLAG(0x1ffc);
        }

        if (IrqSt & HSUSBD_BUSINTSTS_RESUMEIF_Msk)
        {
            HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk);
            HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_RESUMEIF_Msk);
        }

        if (IrqSt & HSUSBD_BUSINTSTS_SUSPENDIF_Msk)
        {
            HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_RESUMEIEN_Msk);
            HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_SUSPENDIF_Msk);
        }

        if (IrqSt & HSUSBD_BUSINTSTS_HISPDIF_Msk)
        {
            HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPPKIEN_Msk);
            HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_HISPDIF_Msk);
        }

        if (IrqSt & HSUSBD_BUSINTSTS_DMADONEIF_Msk)
        {
            g_hsusbd_DmaDone = 1;
            HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_DMADONEIF_Msk);

            if (HSUSBD->DMACTL & HSUSBD_DMACTL_DMARD_Msk)
            {
                if (g_hsusbd_ShortPacket == 1)
                {
                    HSUSBD->EP[EPA].EPRSPCTL = (HSUSBD->EP[EPA].EPRSPCTL & 0x10) | HSUSBD_EP_RSPCTL_SHORTTXEN;    // packet end
                    g_hsusbd_ShortPacket = 0;
                }
            }
        }

