OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBD_RNDIS/rndis.c
        if (IrqSt & HSUSBD_BUSINTSTS_PHYCLKVLDIF_Msk)
            HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_PHYCLKVLDIF_Msk);

        if (IrqSt & HSUSBD_BUSINTSTS_VBUSDETIF_Msk)
        {
            if (HSUSBD_IS_ATTACHED())
            {
                /* USB Plug In */
                HSUSBD_ENABLE_USB();
                u32TimeOutCnt = SystemCoreClock; /* 1 second time-out */

                while (!(HSUSBD->PHYCTL & HSUSBD_PHYCTL_PHYCLKSTB_Msk))
                    if (--u32TimeOutCnt == 0) break;

                HSUSBD->OPER |= (HSUSBD_OPER_HISHSEN_Msk | HSUSBD_OPER_HISPDEN_Msk);
            }
            else
            {
                /* USB Un-plug */
                HSUSBD_DISABLE_USB();
                HSUSBD->OPER &= ~HSUSBD_OPER_HISHSEN_Msk;
            }

            HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_VBUSDETIF_Msk);
        }
    }

    if (IrqStL & HSUSBD_GINTSTS_CEPIF_Msk)
    {
        IrqSt = HSUSBD->CEPINTSTS & HSUSBD->CEPINTEN;

        if (IrqSt & HSUSBD_CEPINTSTS_SETUPTKIF_Msk)
        {
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_SETUPTKIF_Msk);
            return;
        }

        if (IrqSt & HSUSBD_CEPINTSTS_SETUPPKIF_Msk)
        {
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_SETUPPKIF_Msk);
            HSUSBD_ProcessSetupPacket();
            return;
        }

        if (IrqSt & HSUSBD_CEPINTSTS_OUTTKIF_Msk)
        {
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_OUTTKIF_Msk);
            HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_STSDONEIEN_Msk | HSUSBD_CEPINTEN_SETUPPKIEN_Msk);
            return;
        }

        if (IrqSt & HSUSBD_CEPINTSTS_INTKIF_Msk)
        {

            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_INTKIF_Msk);

            if (!(IrqSt & HSUSBD_CEPINTSTS_STSDONEIF_Msk))
            {
                HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_TXPKIF_Msk);
                HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_TXPKIEN_Msk | HSUSBD_CEPINTEN_SETUPPKIEN_Msk);
                HSUSBD_CtrlIn();
            }
            else
            {
                HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_TXPKIF_Msk);
                HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_TXPKIEN_Msk | HSUSBD_CEPINTEN_STSDONEIEN_Msk | HSUSBD_CEPINTEN_SETUPPKIEN_Msk);
            }

            return;
        }

        if (IrqSt & HSUSBD_CEPINTSTS_PINGIF_Msk)
        {
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_PINGIF_Msk);
            return;
        }

        if (IrqSt & HSUSBD_CEPINTSTS_TXPKIF_Msk)
        {
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_STSDONEIF_Msk);
            HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_NAKCLR);

            if (g_hsusbd_CtrlInSize)
            {
                HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_INTKIF_Msk);
                HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_INTKIEN_Msk | HSUSBD_CEPINTEN_SETUPPKIEN_Msk);
            }
            else
            {
                HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_STSDONEIF_Msk);
                HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPPKIEN_Msk | HSUSBD_CEPINTEN_STSDONEIEN_Msk);
            }

            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_TXPKIF_Msk);
            return;
        }

        if (IrqSt & HSUSBD_CEPINTSTS_RXPKIF_Msk)
        {
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_RXPKIF_Msk);
            HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_NAKCLR);
            HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPPKIEN_Msk | HSUSBD_CEPINTEN_STSDONEIEN_Msk);
            return;
        }

        if (IrqSt & HSUSBD_CEPINTSTS_NAKIF_Msk)
        {
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_NAKIF_Msk);
            return;
        }

        if (IrqSt & HSUSBD_CEPINTSTS_STALLIF_Msk)
        {
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_STALLIF_Msk);
            return;
        }

        if (IrqSt & HSUSBD_CEPINTSTS_ERRIF_Msk)
        {
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_ERRIF_Msk);
            return;
        }

        if (IrqSt & HSUSBD_CEPINTSTS_STSDONEIF_Msk)
        {
            HSUSBD_UpdateDeviceState();
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_STSDONEIF_Msk);
            HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPPKIEN_Msk);
            return;
        }

        if (IrqSt & HSUSBD_CEPINTSTS_BUFFULLIF_Msk)
        {
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_BUFFULLIF_Msk);
            return;
        }

        if (IrqSt & HSUSBD_CEPINTSTS_BUFEMPTYIF_Msk)
        {
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_BUFEMPTYIF_Msk);
            return;
        }
    }

    /* bulk in */
    if (IrqStL & HSUSBD_GINTSTS_EPAIF_Msk)
    {
        IrqSt = HSUSBD->EP[EPA].EPINTSTS & HSUSBD->EP[EPA].EPINTEN;
        HSUSBD_ENABLE_EP_INT(EPA, 0);
        HSUSBD_CLR_EP_INT_FLAG(EPA, IrqSt);
    }

    /* bulk out */
    if (IrqStL & HSUSBD_GINTSTS_EPBIF_Msk)
    {
        volatile int i, len, acc_len;
        volatile uint8_t *dptr;
        RNDIS_MSG_HDR *hdr;
        HSUSBD_ENABLE_EP_INT(EPB, 0);
        IrqSt = HSUSBD->EP[EPB].EPINTSTS & HSUSBD->EP[EPB].EPINTEN;
        len = HSUSBD->EP[EPB].EPDATCNT & 0xffff;

        if (len > 0)
        {
            acc_len = _rtxq.data_len[_rtxq.usb_idx];
            hdr = (RNDIS_MSG_HDR *)&_rtxq.data[_rtxq.usb_idx][0];

            if ((acc_len >= 44) &&
                    ((acc_len + len > (44 + PKT_FRAME_BUF_SIZE)) || (hdr->MessageType != REMOTE_NDIS_PACKET_MSG)))
            {
                // printf("Drop 0x%x, %d\n", hdr->MessageType, hdr->MessageLength);

                dptr = &_rtxq.data[_rtxq.usb_idx][512];

                for (i = 0; i < len; i++)
                    *dptr = HSUSBD->EP[EPB].EPDAT_BYTE;

                _rtxq.data_len[_rtxq.usb_idx] = 0;
            }
            else
            {
                dptr = &_rtxq.data[_rtxq.usb_idx][acc_len];

                /* shift dptr to 4-byte aligned */
                for (i = 0; ((uint32_t)dptr & 0x3) && i < len; i++)
                    *dptr++ = HSUSBD->EP[EPB].EPDAT_BYTE;

                volatile int r = len - i;

                if (r)
                {
                    if (!gRndisInData && len > 31) /* DMA serve */
                    {
                        RNDIS_OutData_DMA((uint32_t)dptr, r);
                    }
                    else
                    {
                        {
                            uint32_t *pu32Dst = (uint32_t *)dptr;
                            uint32_t u32Words = r / 4;
                            uint32_t j;

                            for (j = 0; j < u32Words; j++)
                            {
                                pu32Dst[j] = HSUSBD->EP[EPB].EPDAT;
                            }

                            i    += u32Words * 4;
                            dptr += u32Words * 4;
                        }

                        for (; i < len; i++)
                        {
                            *dptr++ = HSUSBD->EP[EPB].EPDAT_BYTE;
                        }
                    }
                }

                _rtxq.data_len[_rtxq.usb_idx] += len;
            }

            if ((hdr->MessageType == REMOTE_NDIS_PACKET_MSG) &&
                    (_rtxq.data_len[_rtxq.usb_idx] >= hdr->MessageLength))
            {
                if (_rtxq.data_len[_rtxq.usb_idx] > hdr->MessageLength)
                    printf("Long tx rmsg!\n");

                if (((_rtxq.usb_idx + 1) % RQ_SZ) == _rtxq.eth_done_idx)
                {
                    // printf("! %d %d %d\n", _rtxq.usb_idx, _rtxq.eth_idx, _rtxq.eth_done_idx);   /* drop the current packet */
                    _rtxq.data_len[_rtxq.usb_idx] = 0;
                }
                else
                {
                    // printf("TX: %d\n", hdr->MessageLength);
                    _rtxq.usb_idx = (_rtxq.usb_idx + 1) % RQ_SZ;
                    _rtxq.data_len[_rtxq.usb_idx] = 0;
                }
            }
        }

        HSUSBD_CLR_EP_INT_FLAG(EPB, IrqSt);
    }

    /* interrupt in */
    if (IrqStL & HSUSBD_GINTSTS_EPCIF_Msk)
    {
        IrqSt = HSUSBD->EP[EPC].EPINTSTS & HSUSBD->EP[EPC].EPINTEN;
        RNDIS_IsAvaiable();
        HSUSBD_CLR_EP_INT_FLAG(EPC, IrqSt);
    }

    if (IrqStL & HSUSBD_GINTSTS_EPDIF_Msk)
    {
        IrqSt = HSUSBD->EP[EPD].EPINTSTS & HSUSBD->EP[EPD].EPINTEN;
        HSUSBD_CLR_EP_INT_FLAG(EPD, IrqSt);
    }

