OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBD_RNDIS/rndis.c
    switch (msgtype)
    {
        case REMOTE_NDIS_INITIALIZE_MSG:
            *ptr = REMOTE_NDIS_INITIALIZE_CMPLT;
            *(ptr + 1) = 52;
            *(ptr + 2) = *(pMsg + 2);  /* Request ID */
            *(ptr + 3) = RNDIS_STATUS_SUCCESS;  /* Status */
            *(ptr + 4) = 0x00000001;    /* MajorVersion */
            *(ptr + 5) = 0x00000000;    /* MinorVersion */
            *(ptr + 6) = 0x00000001;    /* DeviceFlags */
            *(ptr + 7) = 0x00000000;    /* Medium */
            *(ptr + 8) = 0x00000001;    /* max packets per transfer */
            *(ptr + 9) = 0x0000062C;    /* max transfer size */
            *(ptr + 10) = 0x00000000;   /* PacketAlignmentFactor */
            *(ptr + 11) = 0x00000000;   /* AFListOffset */
            *(ptr + 12) = 0x00000000;   /* AFListSize */
            break;

        case REMOTE_NDIS_QUERY_MSG:
            *ptr = REMOTE_NDIS_QUERY_CMPLT;
            *(ptr + 2) = *(pMsg + 2);               /* Request ID */
            RNDIS_ProcessQueryOID(*(pMsg + 3));
            *(ptr + 3) = RNDIS_STATUS_SUCCESS;      /* Status */
            break;

        case REMOTE_NDIS_SET_MSG:
            *ptr = REMOTE_NDIS_SET_CMPLT;
            *(ptr + 1) = 0x10;
            *(ptr + 2) = *(pMsg + 2);               /* Request ID */
            RNDIS_ProcessSetOID(*(pMsg + 3));
            *(ptr + 3) = RNDIS_STATUS_SUCCESS;      /* Status */
            break;

        case REMOTE_NDIS_RESET_MSG:
            *ptr = REMOTE_NDIS_RESET_CMPLT;
            *(ptr + 1) = 0x10;
            *(ptr + 2) = RNDIS_STATUS_SUCCESS;      /* Status */
            *(ptr + 3) = 0x1;      /* AddressingReset */
            break;

        case REMOTE_NDIS_INDICATE_STATUS_MSG:
            break;

        case REMOTE_NDIS_KEEPALIVE_MSG:
            *ptr = REMOTE_NDIS_KEEPALIVE_CMPLT;
            *(ptr + 1) = 0x10;
            *(ptr + 2) = *(pMsg + 2);           /* Request ID */
            *(ptr + 3) = RNDIS_STATUS_SUCCESS;  /* Status */
            break;

        case REMOTE_NDIS_HALT_MSG:
            break;

        default:
            break;
    }
}

extern uint32_t My_EMAC_SendPkt(uint8_t *pu8Data, uint32_t u32Size);

void RNDIS_ProcessOutData(void)
{
    RNDIS_MSG_HDR *hdr;
    uint8_t *ppkt;

    HSUSBD_ENABLE_EP_INT(EPB, HSUSBD_EPINTEN_RXPKIEN_Msk);

    while (_rtxq.eth_idx != _rtxq.usb_idx)
    {
        hdr = (RNDIS_MSG_HDR *)&_rtxq.data[_rtxq.eth_idx][0];
        ppkt = (uint8_t *)&_rtxq.data[_rtxq.eth_idx][hdr->DataOffset + 8];

        if (My_EMAC_SendPkt(ppkt, hdr->DataLength) == 1)
        {
            _rtxq.eth_idx = (_rtxq.eth_idx + 1) % RQ_SZ;
        }
        else
        {
            HSUSBD_ENABLE_EP_INT(EPB, 0);
        }
    }
}

void RNDIS_InData(unsigned int u32PktLen)
{
    uint32_t *ptr = (uint32_t *) & (_rrxq.data[_rrxq.usb_idx][0]);
    uint32_t msglen;

    gRndisInData = 1;
    *(ptr + 1) = msglen = u32PktLen + 44; /* message len = data len + 44 */
    *(ptr + 3) = u32PktLen;              /* data len */

    /* active usbd DMA to send data to FIFO */
    HSUSBD_SET_DMA_READ(BULK_IN_EP_NUM);
    HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_DMADONEIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk | HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_VBUSDETIEN_Msk);
    HSUSBD_SET_DMA_ADDR((uint32_t) & (_rrxq.data[_rrxq.usb_idx][0]));
    HSUSBD_SET_DMA_LEN(msglen);
    g_hsusbd_DmaDone = 0;
    g_hsusbd_ShortPacket = 1;
    HSUSBD_ENABLE_DMA();

    /* wait usbd dma complete */
    while (1)
    {
        if (g_hsusbd_DmaDone)
            break;

        if (!HSUSBD_IS_ATTACHED())
            break;

        if ((HSUSBD->DMACTL & HSUSBD_DMACTL_DMAEN_Msk) == 0)
            break;
    }

    while (HSUSBD->EP[EPA].EPDATCNT & 0xFFFF)
    {
        if (!HSUSBD_IS_ATTACHED())
        {
            gRndisInData = 0;
            return;
        }
    }

    gRndisInData = 0;
}

/*
 *  !! Note! This function is expected to be called from interrupt context.
 */
void RNDIS_OutData_DMA(uint32_t u32Addr, unsigned int u32PktLen)
{
    /* active usbd DMA to send data to FIFO */
    HSUSBD_SET_DMA_WRITE(BULK_OUT_EP_NUM);
    HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_DMADONEIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk | HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_VBUSDETIEN_Msk);
    HSUSBD_SET_DMA_ADDR(u32Addr);
    HSUSBD_SET_DMA_LEN(u32PktLen);
    HSUSBD_ENABLE_DMA();

    /* wait usbd dma complete */
    while (1)
    {
        if (HSUSBD->BUSINTSTS & HSUSBD_BUSINTSTS_DMADONEIF_Msk)
        {
            break;
        }

        if (!HSUSBD_IS_ATTACHED())
            break;

        if ((HSUSBD->DMACTL & HSUSBD_DMACTL_DMAEN_Msk) == 0)
            break;
    }

    while (HSUSBD->EP[EPB].EPDATCNT & 0xFFFF)
    {
        if (!HSUSBD_IS_ATTACHED())
            return;
    }

    HSUSBD_CLR_BUS_INT_FLAG(HSUSBD_BUSINTSTS_DMADONEIF_Msk);
}

void RNDIS_IsAvaiable(void)
{
    static int volatile acnt = 0;

    if (acnt++ == 0)
    {
        //printf("acnt=0\n");
        linkStatus = EMAC_CheckLinkStatus();
    }

    acnt &= 0x1ff;

    if (linkStatus == LINKDOWN)
    {
        HSUSBD->EP[EPC].EPDAT = 0x00000000;   /* 1: avaiable; 0: not */
    }
    else
    {
        HSUSBD->EP[EPC].EPDAT = 0x00000001;   /* 1: avaiable; 0: not */
    }

    HSUSBD->EP[EPC].EPDAT = 0x00000000;
    HSUSBD->EP[EPC].EPTXCNT = 8;
}


void RNDIS_ProcessQueryOID(uint32_t oid)
{
    volatile uint32_t i;
    uint32_t *ptr = (uint32_t *)rndis_response;

    switch (oid)
    {
        case OID_GEN_SUPPORTED_LIST:
        {
            uint32_t len = sizeof(rndis_oidbuffer);
            *(ptr + 1) = 24 + len;      /* message len */
            *(ptr + 4) = len;           /* InformationBufferLength */
            *(ptr + 5) = 0x10;          /* InformationBufferOffset */

            for (i = 0; i < len / 4; i++)
                *(ptr + 6 + i) = rndis_oidbuffer[i];

            break;
        }

        case OID_GEN_HARDWARE_STATUS:
            *(ptr + 1) = 24 + 4; /* message len = 24 + info len */
            *(ptr + 4) = 4;     /* InformationBufferLength */
            *(ptr + 5) = 0x10;  /* InformationBufferOffset */
            *(ptr + 6) = 0;     /* NdisHardwareStatusReady */
            break;

