OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBD_RNDIS/rndis.c
        case OID_GEN_MEDIA_SUPPORTED:
            *(ptr + 1) = 24 + 4; /* message len = 24 + info len */
            *(ptr + 4) = 4;     /* InformationBufferLength */
            *(ptr + 5) = 0x10;  /* InformationBufferOffset */
            *(ptr + 6) = 0;     /* NdisMedium802_3 */
            break;

        case OID_GEN_MEDIA_IN_USE:
            *(ptr + 1) = 24 + 4; /* message len = 24 + info len */
            *(ptr + 4) = 4;     /* InformationBufferLength */
            *(ptr + 5) = 0x10;  /* InformationBufferOffset */
            *(ptr + 6) = 0;     /* NdisMedium802_3 */
            break;

        case OID_GEN_MAXIMUM_FRAME_SIZE:
            *(ptr + 1) = 24 + 4; /* message len = 24 + info len */
            *(ptr + 4) = 4;     /* InformationBufferLength */
            *(ptr + 5) = 0x10;  /* InformationBufferOffset */
            *(ptr + 6) = 1500;  /* 1500 */
            break;

        case OID_GEN_LINK_SPEED:
            linkStatus = EMAC_CheckLinkStatus();
            *(ptr + 1) = 24 + 4; /* message len = 24 + info len */
            *(ptr + 4) = 4;     /* InformationBufferLength */
            *(ptr + 5) = 0x10;  /* InformationBufferOffset */

            if ((linkStatus == LPA_100FULL) || (linkStatus == LPA_100HALF))
            {
                *(ptr + 6) = 1000000; /* 100Mbps */
            }
            else if ((linkStatus == LPA_10FULL) || (linkStatus == LPA_10HALF))
            {
                *(ptr + 6) = 100000; /* 10Mbps */
            }
            else
            {
                *(ptr + 6) = 0; /* disconnected */
            }

            break;

        case OID_GEN_TRANSMIT_BLOCK_SIZE:
            *(ptr + 1) = 24 + 4; /* message len = 24 + info len */
            *(ptr + 4) = 4;     /* InformationBufferLength */
            *(ptr + 5) = 0x10;  /* InformationBufferOffset */
            *(ptr + 6) = 1500;  /* 1518 */
            break;

        case OID_GEN_RECEIVE_BLOCK_SIZE:
            *(ptr + 1) = 24 + 4; /* message len = 24 + info len */
            *(ptr + 4) = 4;     /* InformationBufferLength */
            *(ptr + 5) = 0x10;  /* InformationBufferOffset */
            *(ptr + 6) = 1500;  /* 1518 */
            break;

        case OID_GEN_VENDOR_ID:
            *(ptr + 1) = 24 + 4; /* message len = 24 + info len */
            *(ptr + 4) = 4;     /* InformationBufferLength */
            *(ptr + 5) = 0x10;  /* InformationBufferOffset */
            *(ptr + 6) = 0xFFFFFF; /* Vendors without an IEEE-registered code should use this value */
            break;

        case OID_GEN_VENDOR_DESCRIPTION:
            *(ptr + 1) = 24 + 4; /* message len = 24 + info len */
            *(ptr + 4) = 4;     /* InformationBufferLength */
            *(ptr + 5) = 0x10;  /* InformationBufferOffset */
            *(ptr + 6) = 'N';
            *(ptr + 6) = 'V';
            *(ptr + 6) = 'T';
            *(ptr + 6) = 0x00;
            break;

        case OID_GEN_MAXIMUM_TOTAL_SIZE:
            *(ptr + 1) = 24 + 4; /* message len = 24 + info len */
            *(ptr + 4) = 4;     /* InformationBufferLength */
            *(ptr + 5) = 0x10;  /* InformationBufferOffset */
            *(ptr + 6) = 0x00000616; /* 1558 */
            break;

        case OID_GEN_MEDIA_CONNECT_STATUS:
            *(ptr + 1) = 24 + 4; /* message len = 24 + info len */
            *(ptr + 4) = 4;     /* InformationBufferLength */
            *(ptr + 5) = 0x10;  /* InformationBufferOffset */

            if (linkStatus == LINKDOWN)
                *(ptr + 6) = 0x00000001; /* NdisMediaStateDisconnected */
            else
                *(ptr + 6) = 0x00000000; /* NdisMediaStateConnected */

            break;

        case OID_GEN_VENDOR_DRIVER_VERSION:
            *(ptr + 1) = 24 + 4; /* message len = 24 + info len */
            *(ptr + 4) = 4;     /* InformationBufferLength */
            *(ptr + 5) = 0x10;  /* InformationBufferOffset */
            *(ptr + 6) = 0x00000001;
            break;

        case OID_GEN_XMIT_OK:
            *(ptr + 1) = 24 + 4; /* message len = 24 + info len */
            *(ptr + 4) = 4;     /* InformationBufferLength */
            *(ptr + 5) = 0x10;  /* InformationBufferOffset */
            *(ptr + 6) = u32TxCnt;
            break;

        case OID_GEN_RCV_OK:
            *(ptr + 1) = 24 + 4; /* message len = 24 + info len */
            *(ptr + 4) = 4;     /* InformationBufferLength */
            *(ptr + 5) = 0x10;  /* InformationBufferOffset */
            *(ptr + 6) = u32RxCnt;
            break;

        case OID_GEN_XMIT_ERROR:
            *(ptr + 1) = 24 + 4; /* message len = 24 + info len */
            *(ptr + 4) = 4;     /* InformationBufferLength */
            *(ptr + 5) = 0x10;  /* InformationBufferOffset */
            *(ptr + 6) = 0x00000000;
            break;

        case OID_GEN_RCV_ERROR:
            *(ptr + 1) = 24 + 4; /* message len = 24 + info len */
            *(ptr + 4) = 4;     /* InformationBufferLength */
            *(ptr + 5) = 0x10;  /* InformationBufferOffset */
            *(ptr + 6) = 0x00000000;
            break;

        case OID_GEN_RCV_NO_BUFFER:
            *(ptr + 1) = 24 + 4; /* message len = 24 + info len */
            *(ptr + 4) = 4;     /* InformationBufferLength */
            *(ptr + 5) = 0x10;  /* InformationBufferOffset */
            *(ptr + 6) = 0x00000000;
            break;

        case OID_802_3_PERMANENT_ADDRESS:
            *(ptr + 1) = 24 + 6; /* message len = 24 + info len */
            *(ptr + 4) = 6;     /* InformationBufferLength */
            *(ptr + 5) = 0x10;  /* InformationBufferOffset */

            for (i = 0; i < 6; i++)
                rndis_response[24 + i] = g_au8MacAddr[i];

            break;

        case OID_802_3_CURRENT_ADDRESS:
            *(ptr + 1) = 24 + 6; /* message len = 24 + info len */
            *(ptr + 4) = 6;     /* InformationBufferLength */
            *(ptr + 5) = 0x10;  /* InformationBufferOffset */

            for (i = 0; i < 6; i++)
                rndis_response[24 + i] = g_au8MacAddr[i];

            break;

        case OID_802_3_MAXIMUM_LIST_SIZE:
            *(ptr + 1) = 24 + 4; /* message len = 24 + info len */
            *(ptr + 4) = 4;     /* InformationBufferLength */
            *(ptr + 5) = 0x10;  /* InformationBufferOffset */
            *(ptr + 6) = 0x00000001;
            break;

        case OID_GEN_PHYSICAL_MEDIUM:
            *(ptr + 1) = 24 + 4; /* message len = 24 + info len */
            *(ptr + 4) = 4;     /* InformationBufferLength */
            *(ptr + 5) = 0x10;  /* InformationBufferOffset */
            *(ptr + 6) = 0x00000000;
            break;

        default:
            ;
    }
}

void RNDIS_ProcessSetOID(uint32_t oid)
{
    uint32_t *ptr = (uint32_t *)rndis_response;

    switch (oid)
    {
        case OID_GEN_CURRENT_PACKET_FILTER:
            *(ptr + 1) = 0x10;      /* TODO: message len */
            break;

        case OID_802_3_MULTICAST_LIST:
            *(ptr + 1) = 0x10;      /* TODO: message len */
            break;

        default:
            ;
    }
}
